# Pandas Tips: `read_excel()`

In [1]:
import pandas as pd

Check your pandas version to ensure similar behavior. 

_Version 2.1.1 was released September 2023._

In [2]:
pd.__version__

'2.1.1'

## Basics

### Reading from computer file

In [4]:
!ls

dataset_gen.py   purchases.csv    read_excel.ipynb store_data.xlsx

In [18]:
df = pd.read_excel('store_data.xlsx')

In [19]:
df.head()

     ID First Name Last Name         Phone       LTV
0  4576     Sophia    Walker  602-310-9331    496.87
1  9488     Evelyn    Harris  171-363-6978  38424.41
2  7265      Lucas    Foster  139-658-8905  14413.64
3  8555     Elijah     Jones  538-241-9868  13440.49
4  7023      Mason    Taylor  937-595-5837   1777.37

### Specify sheet name: `sheet_name`

In [7]:
df = pd.read_excel('store_data.xlsx', sheet_name='purchases')

In [9]:
df.head()

,Unnamed: 0,Unnamed: 1,PRODUCT INFORMATION,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
1,2021-10-11 00:00:00,4576,11,Gray Sweater,59.99,No
2,2020-11-13 00:00:00,9488,32,Running Shoes,49.99,Yes
3,2020-08-20 00:00:00,7265,3,Blue Jeans,49.99,Yes
4,2021-04-07 00:00:00,8555,39,Polo Shirt,29.99,No

### Reading from a URL

In [12]:
df = pd.read_excel(
    'https://github.com/kimfetti/Videos/blob/master/Pandas_Tips/data/store_data.xlsx?raw=True',
    sheet_name='purchases'
)

In [13]:
df.head()

,Unnamed: 0,Unnamed: 1,PRODUCT INFORMATION,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
1,2021-10-11 00:00:00,4576,11,Gray Sweater,59.99,No
2,2020-11-13 00:00:00,9488,32,Running Shoes,49.99,Yes
3,2020-08-20 00:00:00,7265,3,Blue Jeans,49.99,Yes
4,2021-04-07 00:00:00,8555,39,Polo Shirt,29.99,No

## $\star$ Level Up $\star$

### Skip unnecessary rows: `skiprows` (header)

In [23]:
df = pd.read_excel(
    'store_data.xlsx', 
    sheet_name='purchases', #specify sheet name
    skiprows=1
)

In [24]:
df.head()

,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
0,2021-10-11 00:00:00,4576.0,11.0,Gray Sweater,59.99,No
1,2020-11-13 00:00:00,9488.0,32.0,Running Shoes,49.99,Yes
2,2020-08-20 00:00:00,7265.0,3.0,Blue Jeans,49.99,Yes
3,2021-04-07 00:00:00,8555.0,39.0,Polo Shirt,29.99,No
4,2022-01-10 00:00:00,7023.0,44.0,Sweatshirt,49.99,No

### `skipfooter` (footer)

In [25]:
df.tail()

,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
1814,2022-11-02 00:00:00,9176.0,54.0,Casual Dress,69.99,No
1815,2023-05-12 00:00:00,8588.0,30.0,Maxi Skirt,39.99,No
1816,2021-12-28 00:00:00,1892.0,27.0,Leather Jacket,119.99,Yes
1817,2022-12-25 00:00:00,7437.0,24.0,Cargo Shorts,22.99,No
1818,TOTAL,NaN,NaN,NaN,76105.20,NaN

In [34]:
df = pd.read_excel(
    'store_data.xlsx', 
    sheet_name='purchases', #specify sheet name
    skiprows=1, #skip 1 header row
    skipfooter=1
)

In [35]:
df.tail()

,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
1813,2020-01-26,1110,14,Plaid Shorts,22.99,Yes
1814,2022-11-02,9176,54,Casual Dress,69.99,No
1815,2023-05-12,8588,30,Maxi Skirt,39.99,No
1816,2021-12-28,1892,27,Leather Jacket,"1,119.99",Yes
1817,2022-12-25,7437,24,Cargo Shorts,22.99,No

### Recognize digit separators: `thousands`

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1818 entries, 0 to 1817
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date of Purchase     1818 non-null   datetime64[ns]
 1   Customer ID          1818 non-null   int64
 2   Product ID           1818 non-null   int64
 3   Product Description  1818 non-null   object
 4   Cost                 1818 non-null   object
 5   Online               1818 non-null   object
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 85.3+ KB

In [84]:
df = pd.read_excel(
    'store_data.xlsx', 
    sheet_name='purchases', #specify sheet name
    skiprows=1, #skip 1 header row
    skipfooter=1, #skip 1 footer row
    thousands=','
)

In [85]:
df.tail()

,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
1813,2020-01-26 00:00:00,1110,14,Plaid Shorts,22.99,Yes
1814,2022-11-02 00:00:00,9176,54,Casual Dress,69.99,No
1815,2023-05-12 00:00:00,8588,30,Maxi Skirt,39.99,No
1816,2021-12-28 00:00:00,1892,27,Leather Jacket,1119.99,Yes
1817,2022-12-25 00:00:00,7437,24,Cargo Shorts,22.99,No

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1818 entries, 0 to 1817
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date of Purchase     1818 non-null   object
 1   Customer ID          1818 non-null   int64
 2   Product ID           1818 non-null   int64
 3   Product Description  1818 non-null   object
 4   Cost                 1818 non-null   float64
 5   Online               1818 non-null   object
dtypes: float64(1), int64(2), object(3)
memory usage: 85.3+ KB

### Convert strings to Booleans: `true_values`, `false_values`

In [44]:
df.Online.value_counts()

Online
No     918
Yes    900
Name: count, dtype: int64

In [96]:
df = pd.read_excel(
    'store_data.xlsx', 
    sheet_name='purchases', #specify sheet name
    skiprows=1, #skip 1 header row
    skipfooter=1, #skip 1 footer row
    thousands=',', #recognize comma as digit separator
    true_values=['Yes'],
    false_values=['No']
)

In [97]:
df.head()

  Date of Purchase  Customer ID  Product ID Product Description   Cost  Online
0       2021-10-11         4576          11        Gray Sweater  59.99   False
1       2020-11-13         9488          32       Running Shoes  49.99    True
2       2020-08-20         7265           3          Blue Jeans  49.99    True
3       2021-04-07         8555          39          Polo Shirt  29.99   False
4       2022-01-10         7023          44          Sweatshirt  49.99   False

In [98]:
df.Online.value_counts()

Online
False    918
True     900
Name: count, dtype: int64

In [99]:
df.Online.sum()

900